[
  {
    "_id": "tutorial01",
    "tutorial01": {
      "ID0001": {
        "paragraphs": [
          {
            "text": "Hi there, adventurer & welcome to the site's tutorial! The following steps are going to walk you through how adventures work."
          },
          {
            "text": "Evrallas is a classic choose-your-own-adventure type of game in which the decisions you make directly affect the story's progress."
          },
          {
            "text": "At each step of a given adventure you are going to be offered a few options to choose from and thus progress the story. For this first step, you can see one option only."
          }
        ],
        "options": [
          {
            "text": "I understand, show me the next step.",
            "nextEventId": "ID0002",
            "visible": true
          }
        ]
      },
      "ID0002": {
        "paragraphs": [
          {
            "text": "In the adventures, you are going to find options ranging from evil to benevolent. Choosing an evil option will not mean you are immediately punished just as choosing something good does not neccesarily mean you are rewarded. It rather signifies the mindset you are progressing through the adventure."
          },
          {
            "text": "Based on your good / evil choices you are going to be prompted with choices that follow a similar pattern, and thus leaving a certain path will not always be a simple task."
          }
        ],
        "options": [
          {
            "text": "I understand, show me the next step.",
            "nextEventId": "ID0003",
            "visible": true
          },
          {
            "text": "Let me review what I was told so far. Take me back to the beginning.",
            "nextEventId": "ID0001",
            "visible": true
          }
        ]
      },
      "ID0003": {
        "paragraphs": [
          {
            "text": "Death is very much an option in Evrallas. Choosing good or evil does not automatically mean death, though, there might be long-term consequences of your actions. Other times you might just open the wrong door, sneak into somewhere you should not have and so on."
          },
          {
            "text": "Hood, the Lord of Death, is very much vigilant at all times and will claim your body should you fall during your adventuring."
          },
          {
            "text": "Whenever you die, you are more than welcome to start the story again and hopefully make better decisions this time."
          }
        ],
        "options": [
          {
            "text": "I understand, show me the next step.",
            "nextEventId": "ID0004",
            "visible": true
          },
          {
            "text": "Take me back one step.",
            "nextEventId": "ID0002",
            "visible": true
          },
          {
            "text": "Let me review what I was told so far. Take me back to the beginning.",
            "nextEventId": "ID0001",
            "visible": true
          }
        ]
      },
      "ID0004": {
        "paragraphs": [
          {
            "text": "Don't worry about saving your progress, it is completely automatic."
          },
          {
            "text": "If you wish to stop and leave, just close your tab. Whenever you return and click on the 'Continue your saved adventure' button you are going to be prompted with your latest progress."
          },
          {
            "text": "Each adventure may only have one saved option at any given time."
          }
        ],
        "options": [
          {
            "text": "I understand, show me the next step.",
            "nextEventId": "ID0005",
            "visible": true
          },
          {
            "text": "Take me back one step.",
            "nextEventId": "ID0003",
            "visible": true
          },
          {
            "text": "Let me review what I was told so far. Take me back to the beginning.",
            "nextEventId": "ID0001",
            "visible": true
          }
        ]
      },
      "ID0005": {
        "paragraphs": [
          {
            "text": "During your adventuring you are going to unlock achievements that show you have achieved certain milestone events in your adventure."
          },
          {
            "text": "They look just like the one below - congrats for unlocking your first Tutorial achievement (if you have been here before the achievement won't unlock again)!"
          },
          {
            "text": "Each achievement can be unlocked once only, however, you are guaranteed that you will not be able to unlock all of them in a single story by playing it once."
          },
          {
            "text": "You may review your collection in the Achievement tab. In your Settings tab you may reset your achievement progress at any time."
          }
        ],
        "options": [
          {
            "text": "I understand, show me the next step.",
            "nextEventId": "ID0006",
            "visible": true
          },
          {
            "text": "Take me back one step.",
            "nextEventId": "ID0004",
            "visible": true
          },
          {
            "text": "Let me review what I was told so far. Take me back to the beginning.",
            "nextEventId": "ID0001",
            "visible": true
          }
        ],
        "achievement": {
          "id": "ID0005",
          "title": "There's a first for everything!",
          "stateCode": "achievementsTutorial01.firstAchievement.state",
          "timestampCode": "achievementsTutorial01.firstAchievement.date"
        }
      },
      "ID0006": {
        "paragraphs": [
          {
            "text": "And that was it! I hope you will enjoy your stay on Evrallas! Send me a message from your About tab if you have any question. In the story selection under the Tutorial tab there are two mini-stories that will get you familiarized with the game."
          },
          {
            "text": "In Will's story, you will have to decide whether you participate in a local rebellion."
          },
          {
            "text": "In Rosie's story, you will have to help her to escape from a Greenskin raid."
          }
        ],
        "options": [
          {
            "text": "Finish the tutorial.",
            "nextEventId": "GAMEWON",
            "visible": true
          }
        ]
      }
    }
  }
]